["JOB SUMMARYDevelops, modifies, enhances and implements software systems designed to support new or.. Performs maintenance and provides technical assistance and advice on existing software solutions..", "We are currently looking for a Software Developers on behalf of our client, an international software.. US General Manager. Travel. up to 60. Company. Our client is a renowned Italian based software company..", "Job Description. The challenge of the .NET Software Developer. At Averna, we work with customers to.. As a .NET Software Developer, your passion for software and expertise in open source and programing will..", "This includes the creation, development, design, and improvement of products, software, applications.. processing patterns Collaborating with other developers by participating in code reviews..", "You'll be expected to make those around you better, participate in designing new software, do code.. The team has senior developers that will continuously be involved in coaching and technical mentoring..", "Position. Software Developer IVLocation. Charlotte NCOnsite. offsite. fully onsite in Charlotte NC. Description of project. Operations level III supportSupporting Customer calls on..", "Job Description a. Well Conversant with DO 178 C processesb. Knowledge in Software Development Life Cyclec. SW Development experience in C or C. for Safety Critical Avionics System having Design..", "They are adding 3 sprint teams to help with this initiative, so we need C. and SQL developers with.. Troubleshoot, debug, maintain, and enhance existing software. Create and execute unit tests for code..", "Will drive application design activities and develop software to meet specifications. Will work with QA.. Will work with support teams to deploy software and resolve..", "Position. Sr Software DeveloperLocation. (100. Remote)Duration. 3. months Contract (High possibility.. Job Summary. The Drupal Developer Administrator will be responsible for full stack activities developing..", "Sr DeveloperThe Senior Developer programs and configures software to meet TIAA business needs.. Under limited supervision, this job identifies and analyzes business software needs, writes complex code..", "This is a full time, hybrid onsite role based out of Charlotte, NC. The .NET Developer will join a team.. This position is perfect for Developers that are looking for an open environment and interesting..", "Software Developer. Entry Level. Position Description. Do you have a proven interest in information.. Develop technical prototypes and assist in the creation of software documentation including..", "Be on the cutting edge of a rapidly growing industry and work with a team of proven innovators!Work You'll DoAs a Software Engineer 2, Developer on our team, you will assist with the design..", "Development includes but is not limited to customized coding, software integration, analysis.. Act as an Agile champion. Responsible for delivering high quality working software and automating manual..", "Senior Full Stack Software DeveloperCharlotte, NC. Strategic Staffing Solutions is searching for a.. Job Title. Senior Full Stack Software Developer. Location. Charlotte, NC (Hybrid). Duration. 12..", "A growing Software Logistics company with over 50 issued or pending patents and a product line that.. 10,000. 140,000 per yearA bit about us A growing Software Logistics company with over 50 issued or..", "Job DescriptionAppian developer lead supporting the GOCRS Appian based applications.Lead of agile scrum.. and testing of enterprise software applications.8 10 years of software delivery and development4..", "Software API Developer III Position Summary Blue Chip Talent has a great opportunity in the Charlotte.. Qualifications and Required Experience for Software API Developer III. Knowledge about API design..", "Description of project Operations level III supportSupporting Customer calls on IVR SystemDescription Follows company software development lifecycle to design, code, configure, test, debug, and..", "Identify integration points. Review technical specs created by other developers. Ensure sufficient.. years' experience in coding software with Java. Proficiency programming in more than one object oriented..", "As a Principal Front End Engineering you will be applying your strong software development and test automation skills to design, develop, test, deploy, maintain and improve Fidelity customer..", "As a Junior Software Developer, you'll get to advance the gospel by assisting with the development of.. RESPONSIBILITIES. Software SolutionsYou'll participate in the development and maintenance of internal..", "Job Title. Sr Software Engineer (Full Stack Java Developer). Location. Charlotte (CIC Preferred, but open to any), Chandler (open to any AZ location) & Dallas. Start Date. 10. 10. 22. Duration..", "Adhere to and drive modern software engineering, Agile and DevOps practices. Closely partner with.. Writing tested, idiomatic, and documented Java Code. Cooperating with the front end developer in the..", "Top candidates will have a strong understanding of software design patterns and building software with.. which will include other developers, a project manager, a QA ,BA, and a designer.Complete two week.."]