["Job Title: Software Developers, Company Name: Tek Ninjas, Description: REQUIRED QUALIFICATIONSSkills Abilities and KnowledgeAbility to read, write, speak and understand EnglishKnowledge of Voice, Data, Video, Wireless technologiesHands on proven exper.., Salary: Salary not listed", "Job Title: Cloud Software Developer, Company Name: Accenture, Description: You'll be expected to make those around you better, participate in designing new software, do code.. The team has senior developers that will continuously be involved in coaching and technical mentoring.., Salary: Salary not listed", "Job Title: Software Developer, Company Name: Emonics, Description: Job Description a. Well Conversant with DO 178 C processesb. Knowledge in Software Development Life Cyclec. SW Development experience in C or C. for Safety Critical Avionics System having Design.., Salary: Salary not listed", "Job Title: Software Developer, Company Name: YER, Description: We are currently looking for a Software Developers on behalf of our client, an international software.. US General Manager. Travel. up to 60. Company. Our client is a renowned Italian based software company.., Salary: Salary not listed", "Job Title: Software Engineer III - Camunda Platform Developer, Company Name: Truist, Description: Development includes but is not limited to customized coding, software integration, analysis.. Act as an Agile champion. Responsible for delivering high quality working software and automating manual.., Salary: Salary not listed", "Job Title: Software Developer, Company Name: Insight Global, Description: Will drive application design activities and develop software to meet specifications. Will work with QA.. Will work with support teams to deploy software and resolve.., Salary: Salary not listed", "Job Title: Software Developer, Company Name: PwC, Description: This includes the creation, development, design, and improvement of products, software, applications.. processing patterns Collaborating with other developers by participating in code reviews.., Salary: Salary not listed", "Job Title: .NET Software Developer, Company Name: Averna, Description: Job Description. The challenge of the .NET Software Developer. At Averna, we work with customers to.. As a .NET Software Developer, your passion for software and expertise in open source and programing will.., Salary: Salary not listed", "Job Title: C++ Software Developer (Remote), Company Name: TEKsystems, Description: They are adding 3 sprint teams to help with this initiative, so we need C. and SQL developers with.. Troubleshoot, debug, maintain, and enhance existing software. Create and execute unit tests for code.., Salary: Salary not listed", "Job Title: Senior Full-Stack Software Developer, Company Name: Strategic Staffing Solutions, Description: Senior Full Stack Software DeveloperCharlotte, NC. Strategic Staffing Solutions is searching for a.. Job Title. Senior Full Stack Software Developer. Location. Charlotte, NC (Hybrid). Duration. 12.., Salary: Salary not listed", "Job Title: Software Developer/.NET/C#, Company Name: Motion Recruitment, Description: This is a full time, hybrid onsite role based out of Charlotte, NC. The .NET Developer will join a team.. This position is perfect for Developers that are looking for an open environment and interesting.., Salary: $60000 - $110000", "Job Title: Appian Developer / Software Engineer, Company Name: Iconma, Description: Job DescriptionAppian developer lead supporting the GOCRS Appian based applications.Lead of agile scrum.. and testing of enterprise software applications.8 10 years of software delivery and development4.., Salary: Salary not listed", "Job Title: Software/API Developer III, Company Name: Blue Chip Talent, Description: Software API Developer III Position Summary Blue Chip Talent has a great opportunity in the Charlotte.. Qualifications and Required Experience for Software API Developer III. Knowledge about API design.., Salary: Salary not listed", "Job Title: Sr. Software Developer - Electric Motors (Hybrid/ Relo), Company Name: Randstad, Description: Support the development of the motor controllers and modify and tune the software for improved.. Directs testing and debugging of software. Determines testing methods. Ensures documentation of all.., Salary: Salary not listed", "Job Title: Software Developer - Entry Level, Company Name: CGI Group, Inc., Description: Software Developer. Entry Level. Position Description. Do you have a proven interest in information.. Develop technical prototypes and assist in the creation of software documentation including.., Salary: Salary not listed", "Job Title: Senior Software Developer, Company Name: Compunnel, Description: Description of project Operations level III supportSupporting Customer calls on IVR SystemDescription Follows company software development lifecycle to design, code, configure, test, debug, and.., Salary: Salary not listed", "Job Title: Sr Software Developer, Company Name: TIAA, Description: Sr DeveloperThe Senior Developer programs and configures software to meet TIAA business needs.. Under limited supervision, this job identifies and analyzes business software needs, writes complex code.., Salary: Salary not listed", "Job Title: Software Developer, Company Name: Jobot, Description: A growing Software Logistics company with over 50 issued or pending patents and a product line that.. 10,000. 140,000 per yearA bit about us A growing Software Logistics company with over 50 issued or.., Salary: Salary not listed", "Job Title: Software Developer, Sr, Company Name: Tech Providers, Inc., Description: Position. Sr Software DeveloperLocation. (100. Remote)Duration. 3. months Contract (High possibility.. Job Summary. The Drupal Developer Administrator will be responsible for full stack activities developing.., Salary: Salary not listed", "Job Title: Associate Software Developer, Company Name: Spectrum, Description: Job Description. JOB SUMMARY. Develop, modify, enhance, and implement software systems designed to.. Perform maintenance and provides technical assistance to the business on existing software products.., Salary: Salary not listed", "Job Title: Advanced Java Software Developer- Remote, Company Name: Florida Blue, Description: Identify integration points. Review technical specs created by other developers. Ensure sufficient.. years' experience in coding software with Java. Proficiency programming in more than one object oriented.., Salary: Salary not listed", "Job Title: Sr. Mobile Software Developer, Company Name: AdvancedMD, Description: Top candidates will have a strong understanding of software design patterns and building software with.. which will include other developers, a project manager, a QA ,BA, and a designer.Complete two week.., Salary: Salary not listed", "Job Title: Junior Software Developer, Company Name: Elevation Church, Description: As a Junior Software Developer, you'll get to advance the gospel by assisting with the development of.. RESPONSIBILITIES. Software SolutionsYou'll participate in the development and maintenance of internal.., Salary: Salary not listed", "Job Title: Software Engineer Developer, Company Name: Fidelity Investments, Description: As a Principal Front End Engineering you will be applying your strong software development and test automation skills to design, develop, test, deploy, maintain and improve Fidelity customer.., Salary: Salary not listed", "Job Title: Senior Software Developer- Microservices, Company Name: NTT DATA Services, Description: Adhere to and drive modern software engineering, Agile and DevOps practices. Closely partner with.. Writing tested, idiomatic, and documented Java Code. Cooperating with the front end developer in the.., Salary: Salary not listed", "Job Title: Sr Software Engineer (Full Stack Java Developer), Company Name: Experis, Description: Job Title. Sr Software Engineer (Full Stack Java Developer). Location. Charlotte (CIC Preferred, but open to any), Chandler (open to any AZ location) & Dallas. Start Date. 10. 10. 22. Duration.., Salary: Salary not listed"]